S3/background/system/pointLocation2.txt
( 3.156 -0.340 0.000 )
( 3.137 -0.340 0.032 )
( 3.118 -0.340 0.064 )
( 3.099 -0.340 0.096 )
( 3.081 -0.340 0.128 )
( 3.062 -0.340 0.160 )
( 3.043 -0.340 0.193 )
( 3.025 -0.340 0.225 )
( 3.006 -0.340 0.257 )
( 2.988 -0.340 0.289 )
( 2.969 -0.340 0.321 )
( 2.951 -0.340 0.354 )
( 2.932 -0.340 0.386 )
( 2.914 -0.340 0.418 )
( 2.895 -0.340 0.451 )
( 2.877 -0.340 0.483 )
